app/Controllers/admin/Users.php

    public function update_avatar()
    {

        $val = $this->validate([
			'avatar' => [
				'rules' => 'uploaded[avatar]|mime_in[avatar,image/jpg,image/jpeg,image/gif,image/png]|max_size[avatar,2048]',
				'errors' => [
					'uploaded' => 'Harus Ada File yang diupload',
					'mime_in' => 'File Extention Harus Berupa jpg,jpeg,gif,png',
					'max_size' => 'Ukuran File Maksimal 2 MB'
				]
            ],
            'id' => 'required',
        ]);

        if($val)
        {
            $imageFile = $this->request->getFile('avatar');
            $fileName = $imageFile->getRandomName();
            $imageFile->move('assets/uploads/avatar/', $fileName);

            $data = [
                'avatar' => $fileName,
            ];

            $builder = $this->db->table("users");
            $builder->where("id", $this->request->getPost("id"));
            $builder->update($data);
---
UPDATE `users` SET `avatar` = '1648109012_806f40ac947445e7a495.png'
WHERE `id` = '1'