app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `id` = '4'
---
    public function getUser($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            return $this->getWhere(['id' => $id]);